/* This computer's Internet connection appears to be offline. */
"CONNECTION_DOWN" = "This computer's Internet connection appears to be offline.";

/* This computer's Internet connection may be offline. */
"CONNECTION_INDETERMINATE" = "This computer's Internet connection may be offline.";

/* This computer's Internet connection appears to be online. */
"CONNECTION_UP" = "This computer's Internet connection appears to be online.";

/* This computer's DNS server is not responding. */
"NAMESERVER_DOWN" = "This computer's DNS server is not responding.";

/* The DNS server could not find the server name. */
"NAMELOOKUP_FAILED" = "The DNS server could not find the server name.";

/* This computer's router is not responding. */
"ROUTER_DOWN" = "This computer's router is not responding.";

/* The server this computer is attempting to connect to is not responding. */
"SERVER_DOWN" = "The server this computer is attempting to connect to is not responding.";

/* This computer's Internet connection appears to be online. */
"SERVER_UP" = "This computer's Internet connection appears to be online.";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"KEYCHAIN_LABEL_FORMAT" = "%@ (%@)";

/* Kind string used for keychain items from forms-based logins */
"KEYCHAIN_WEB_FORM_PASSWORD" = "Web form password";

/* HTTP result code string */
"accepted" = "accepted";

/* HTTP result code string */
"bad gateway" = "bad gateway";

/* HTTP result code string */
"bad request" = "bad request";

/* HTTP result code string */
"client error" = "client error";

/* HTTP result code string */
"conflict" = "conflict";

/* HTTP result code string */
"continue" = "continue";

/* HTTP result code string */
"created" = "created";

/* HTTP result code string */
"expectation failed" = "expectation failed";

/* HTTP result code string */
"forbidden" = "forbidden";

/* HTTP result code string */
"found" = "found";

/* HTTP result code string */
"gateway timed out" = "gateway timed out";

/* HTTP result code string */
"informational" = "informational";

/* HTTP result code string */
"internal server error" = "internal server error";

/* HTTP result code string */
"length required" = "length required";

/* HTTP result code string */
"method not allowed" = "method not allowed";

/* HTTP result code string */
"moved permanently" = "moved permanently";

/* HTTP result code string */
"multiple choices" = "multiple choices";

/* HTTP result code string */
"needs proxy" = "needs proxy";

/* HTTP result code string */
"no content" = "no content";

/* HTTP result code string */
"no error" = "no error";

/* HTTP result code string */
"non-authoritative information" = "non-authoritative information";

/* HTTP result code string */
"not found" = "not found";

/* HTTP result code string */
"not modified" = "not modified";

/* HTTP result code string */
"partial content" = "partial content";

/* HTTP result code string */
"payment required" = "payment required";

/* HTTP result code string */
"precondition failed" = "precondition failed";

/* HTTP result code string */
"proxy authentication required" = "proxy authentication required";

/* HTTP result code string */
"redirected" = "redirected";

/* HTTP result code string */
"no longer exists" = "no longer exists";

/* HTTP result code string */
"request timed out" = "request timed out";

/* HTTP result code string */
"request too large" = "request too large";

/* HTTP result code string */
"requested URL too long" = "requested URL too long";

/* HTTP result code string */
"requested range not satisfiable" = "requested range not satisfiable";

/* HTTP result code string */
"reset content" = "reset content";

/* HTTP result code string */
"see other" = "see other";

/* HTTP result code string */
"server error" = "server error";

/* HTTP result code string */
"service unavailable" = "service unavailable";

/* HTTP result code string */
"success" = "success";

/* HTTP result code string */
"switching protocols" = "switching protocols";

/* HTTP result code string */
"temporarily redirected" = "temporarily redirected";

/* HTTP result code string */
"unacceptable" = "unacceptable";

/* HTTP result code string */
"unauthorized" = "unauthorized";

/* HTTP result code string */
"unimplemented" = "unimplemented";

/* HTTP result code string */
"unsupported media type" = "unsupported media type";

/* HTTP result code string */
"unsupported version" = "unsupported version";

/* kCFErrorHTTPProxyConnectionFailure description */
"Err306" = "There was a problem communicating with the web proxy server (HTTP).";

/* kCFErrorHTTPSProxyConnectionFailure description */
"Err310" = "There was a problem communicating with the secure web proxy server (HTTPS).";

/* WebFoundationErrorCancelled description */
"Err-999" = "cancelled";

/* WebFoundationErrorBadURLError description */
"Err-1000" = "bad URL";

/* WebFoundationErrorTimedOut description */
"Err-1001" = "The request timed out.";

/* WebFoundationErrorUnsupportedURL description */
"Err-1002" = "unsupported URL";

/* WebFoundationErrorCannotFindHostError description */
"Err-1003" = "A server with the specified hostname could not be found.";

/* WebFoundationErrorCannotConnectToHostError description */
"Err-1004" = "Could not connect to the server.";

/* WebFoundationErrorNetworkConnectionLostError description */
"Err-1005" = "The network connection was lost.";

/* WebFoundationErrorDNSLookupError description */
"Err-1006" = "DNS lookup error";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"Err-1007" = "too many HTTP redirects";

/* WebFoundationErrorResourceUnavailableError description */
"Err-1008" = "resource unavailable";

/* WebFoundationErrorNotConnectedToInternetError description */
"Err-1009" = "This computer’s Internet connection appears to be offline.";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"Err-1010" = "redirected to nowhere";

/* WebFoundationErrorBadServerResponseError description */
"Err-1011" = "There was a bad response from the server.";

/* WebFoundationErrorZeroByteResourceError description */
"Err-1014" = "zero byte resource";

/* WebFoundationErrorCannotDecodeRawData description */
"Err-1015" = "cannot decode raw data";

/* WebFoundationErrorCannotDecodeContentData description */
"Err-1016" = "cannot decode content data";

/* WebFoundationErrorCannotParseResponse description */
"Err-1017" = "cannot parse response";

/* kCFURLErrorInternationalRoamingOff description */
"Err-1018" = "International roaming is currently off.";

/* kCFURLErrorCallIsActive description */
"Err-1019" = "A data connection cannot be established since a call is currently active.";

/* kCFURLErrorDataNotAllowed description */
"Err-1020" = "A data connection is not currently allowed.";

/* kCFURLErrorRequestBodyStreamExhausted description.  Should never be seen by an end user. */
"Err-1021" = "request body stream exhausted";
	
/* WebFoundationErrorFileDoesNotExist description */
"Err-1100" = "The requested URL was not found on this server.";

/* WebFoundationErrorFileIsDirectory description */
"Err-1101" = "file is directory";

/* WebFoundationErrorNoPermissionsToReadFile description */
"Err-1102" = "You do not have permission to access the requested resource.";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"Err-1103" = "resource exceeds maximum size";

/* WebFoundationErrorSecureConnectionFailed description */
"Err-1200" = "An SSL error has occurred and a secure connection to the server cannot be made.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201" = "The certificate for this server has expired.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201.w" = "The certificate for this server has expired. You might be connecting to a server that is pretending to be “%@” which could put your confidential information at risk.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202" = "The certificate for this server is invalid.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202.w" = "The certificate for this server is invalid. You might be connecting to a server that is pretending to be “%@” which could put your confidential information at risk.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203" = "The certificate for this server was signed by an unknown certifying authority.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203.w" = "The certificate for this server was signed by an unknown certifying authority. You might be connecting to a server that is pretending to be “%@” which could put your confidential information at risk.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204" = "The certificate for this server is not yet valid.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204.w" = "The certificate for this server is not yet valid. You might be connecting to a server that is pretending to be “%@” which could put your confidential information at risk.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205" = "The server did not accept the certificate.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205.w" = "The server “%@” did not accept the certificate.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206" = "The server requires a client certificate.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206.w" = "The server “%@” requires a client certificate.";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"Err-2000" = "can’t load from network";

/* WebFoundationErrorCannotCreateFile description */
"Err-3000" = "Cannot create file";

/* WebFoundationErrorCannotOpenFile description */
"Err-3001" = "Cannot open file";

/* WebFoundationErrorCannotCloseFile description */
"Err-3002" = "Failure occurred while closing file";

/* WebFoundationErrorCannotWriteToFile description */
"Err-3003" = "Cannot write file";

/* WebFoundationErrorCannotRemoveFile description */
"Err-3004" = "Cannot remove file";

/* WebFoundationErrorCannotMoveFile description */
"Err-3005" = "Cannot move file";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Err-3006" = "Download decoding failed";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Err-3007" = "Download decoding failed";

/* Recovery suggestion */
"Would you like to connect to the server anyway?" = "Would you like to connect to the server anyway?";

/* Recovery suggestion */
"To change your proxy settings, open Network preferences, click Advanced, and then click Proxies. For help with this problem, contact your system administrator." = "To change your proxy settings, open Network preferences, click Advanced, and then click Proxies. For help with this problem, contact your system administrator.";
